NextFOAM-2501/tutorials/basic/overPotentialFoam/cylinder/cylinderAndBackground/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2 -0.05 -2.0)
    ( 2 -0.05 -2.0)
    ( 2  0.05 -2.0)
    (-2  0.05 -2.0)
    (-2 -0.05  2.0)
    ( 2 -0.05  2.0)
    ( 2  0.05  2.0)
    (-2  0.05  2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 1 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);


// ************************************************************************* //
